## Data cleaning and plotting project

During the summer the Club of Undergraduate Economic Students moved to create a data visualization dashboard of economic data for Miami-Dade county and all of Florida. While I do not know much about what happened with the project, I was motivated enough to apply and do the entry project. This will be a walk-through of the entry project, and the materials will be posted on its respective Github repository.

### The project

Anyone that was interested in participating had to prove their data cleaning and visualization capacities using only Python, and we were given a simple task. Turn a damaged and disorganized data set into a usable one. Let's import it using Pandas and see.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Before.csv')

In [3]:
df.shape

(30811, 3)

In [4]:
df.head()

,Unnamed: 0,States and selected areas: Employment status,"of the civilian noninstitutional population, January 1976 to date,"
0,0,seasonally adjusted,NaN
1,1,NaN,NaN
2,2,NaN,NaN
3,3,NaN,Civilian labor force
4,4,NaN,NaN

Oh no.

Using .head() is useful, but I still don't know what the data actually looks like. Let's try seeing more.

In [5]:
df.head(20)

,Unnamed: 0,States and selected areas: Employment status,"of the civilian noninstitutional population, January 1976 to date,"
0,0,seasonally adjusted,NaN
1,1,NaN,NaN
2,2,NaN,NaN
3,3,NaN,Civilian labor force
4,4,NaN,NaN
5,5,NaN,NaN
6,6,Civilian,Employed Unemployed
7,7,State and area noninsti-,NaN
8,8,tutional,Percent
9,9,population,Total of Percent ...
10,10,NaN,population Total of Total ...
11,11,NaN,population labor
12,12,NaN,force
13,13,NaN,NaN
14,14,NaN,NaN
15,15,NaN,January 1976
16,16,NaN,NaN
17,17,NaN,NaN
18,18,"Alabama ..................... 2,605,000","1,492,409 57.3 1,392,154 53.4 ..."
19,19,"Alaska ...................... 232,000","159,154 68.6 147,809 63.7 ..."

In [6]:
df[60:80]

,Unnamed: 0,States and selected areas: Employment status,"of the civilian noninstitutional population, January 1976 to date,"
60,60,"South Carolina .............. 1,984,000","1,292,816 65.2 1,195,062 60.2 ..."
61,61,"South Dakota ................ 477,000","308,735 64.7 298,900 62.7 ..."
62,62,"Tennessee ................... 3,078,000","1,819,844 59.1 1,710,143 55.6 ..."
63,63,"Texas ....................... 8,818,000","5,627,987 63.8 5,298,778 60.1 ..."
64,64,"Utah ........................ 824,000","519,498 63.0 489,265 59.4 ..."
65,65,"Vermont ..................... 339,000","213,667 63.0 195,099 57.6 ..."
66,66,"Virginia .................... 3,534,000","2,328,545 65.9 2,190,847 62.0 ..."
67,67,"Washington .................. 2,598,000","1,584,688 61.0 1,446,319 55.7 ..."
68,68,"West Virginia ............... 1,352,000","702,600 52.0 647,491 47.9 ..."
69,69,"Wisconsin ................... 3,245,000","2,125,315 65.5 2,003,102 61.7 ..."
70,70,"Wyoming ..................... 270,000","175,876 65.1 168,592 62.4 ..."
71,71,NaN,NaN
72,72,NaN,NaN
73,73,NaN,February 1976
74,74,NaN,NaN
75,75,NaN,NaN
76,76,"Alabama ..................... 2,610,000","1,491,820 57.2 1,391,975 53.3 ..."
77,77,"Alaska ...................... 234,000","158,961 67.9 147,666 63.1 ..."
78,78,"Arizona ..................... 1,626,000","971,753 59.8 871,997 53.6 ..."
79,79,"Arkansas .................... 1,538,000","882,316 57.4 817,132 53.1 ..."

Let's take a good look at this.

There is an unnamed column which seems to represent the index of the rows. In retrospect, I could have specified the `index_col=0` argument in the second cell, but when I did this about two months ago I didn't do that. I digress. It also appears that the column titles are not indicative of the data they host. Further, there are column names from index 0 to 11 sort of haphazardly placed with the dates about 3 rows above the actual data. 

Even worse, the state name and the population data is in the same column separated by a bunch of periods. The rest of the data follows it and it's all packed together. Whoever destroyed this data clearly did so with malicious intent. Also, between the monthly data is separated by a bunch of whitespace with the dates in the 3rd row.

In the email containing this entry project, I was also given a spreadsheet showing what the end result should look like. Let's bring it into our notebook and see what this should look like.

In [7]:
after = pd.read_csv('After.csv', index_col=0)

In [8]:
after.head()

,State/Area,Population,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate,Date
0,Alaska,"232,000","159,154",68.6,"147,809",63.7,"11,345",7.1,1/1976
1,Arizona,"1,621,000","972,413",60.0,"872,738",53.8,"99,675",10.3,1/1976
2,Arkansas,"1,536,000","882,835",57.5,"817,756",53.2,"65,079",7.4,1/1976
3,California,"15,621,000","9,781,720",62.6,"8,892,663",56.9,"889,057",9.1,1/1976
4,Los Angeles County,"5,273,000","3,375,681",64.0,"3,078,200",58.4,"297,481",8.8,1/1976

Alright so this makes it easy to infer which data is what from `Before.csv`. Let's make a move here and see what we can do.

Let's delete the whitespace up until index row 15, as well as delete the unnamed index column that is created when using `.to_csv()`.

In [9]:
df = df.iloc[15:]
del df['Unnamed: 0']

In [10]:
df.head()

,States and selected areas: Employment status,"of the civilian noninstitutional population, January 1976 to date,"
15,NaN,January 1976
16,NaN,NaN
17,NaN,NaN
18,"Alabama ..................... 2,605,000","1,492,409 57.3 1,392,154 53.4 ..."
19,"Alaska ...................... 232,000","159,154 68.6 147,809 63.7 ..."

Let's go ahead and assign column names, even if they probably won't be used later on.

In [11]:
df.columns = ['State/Area_temp', 'temp']

At this point, it is unclear if there are multiple spaces separating data in the second column, so we're gonna use `.replace()` with regex to replace multiple spaces with just one to make the usage of `.split()` feasible later on. Then we're gonna go ahead and drop empty rows (based on if `State/Area_temp` has a NaN value) and reset the index.

In [12]:
df['temp'].replace(r'\s+', ' ', regex=True, inplace=True)
df.dropna(subset=['State/Area_temp'], inplace=True)
df.reset_index(drop=True, inplace=True)

In [13]:
df.head()

,State/Area_temp,temp
0,"Alabama ..................... 2,605,000","1,492,409 57.3 1,392,154 53.4 100,255 6.7"
1,"Alaska ...................... 232,000","159,154 68.6 147,809 63.7 11,345 7.1"
2,"Arizona ..................... 1,621,000","972,413 60.0 872,738 53.8 99,675 10.3"
3,"Arkansas .................... 1,536,000","882,835 57.5 817,756 53.2 65,079 7.4"
4,"California .................. 15,621,000","9,781,720 62.6 8,892,663 56.9 889,057 9.1"

Perfect. The data now seems to maintain some semblance of readability and it is (more or less) uniformly separated and displayed in the `temp` column.

The next challenge is creating the `Date` column in our spreadsheet. Remember the date was not placed laterally with our data, so we need to figure out a way to put the date in next to our data and have the month go up by one after Wyoming's data was recorded.

First I'm going to go ahead and create a column for the date and leave it empty beforehand just to have it ready. I'll convert it to the datetime data type using `.to_datetime()`. Something important to note, the `errors='coerce'` argument forces incorrect parsing, a.k.a. our NaN values to be set as NaT. The default argument is `raise` which will raise an error in the event there is incorrect parsing.

In [14]:
df['Date'] = np.nan
df['Date'] = pd.to_datetime(df['Date'], errors='coerce')

This is the tricky part. How do we generate the date and place it next to our data like the end spreadsheet? The way I did it was to figure out which was the first state of each month and grab each of those (with the index intact) and place them in a new dataframe. So, it seems that Alabama is the first entry every month. Note that in the data there are three extra entries: Washington D.C., New York City, and Los Angeles. This means that there are 53 entries every month. 

Also remember that dataframes are a list of dictionaries, with the key-item pairs being the column name and a list of the respective data. Thus, they can be indexed in a way that we can select every 53rd row (which is Alabama) and place it in another dataframe, which I will call `bridge` because reasons.

In [15]:
bridge = df[::53]

In [16]:
bridge.head()

,State/Area_temp,temp,Date
0,"Alabama ..................... 2,605,000","1,492,409 57.3 1,392,154 53.4 100,255 6.7",NaT
53,"Alabama ..................... 2,610,000","1,491,820 57.2 1,391,975 53.3 99,845 6.7",NaT
106,"Alabama ..................... 2,615,000","1,490,600 57.0 1,392,137 53.2 98,463 6.6",NaT
159,"Alabama ..................... 2,620,000","1,489,947 56.9 1,393,177 53.2 96,770 6.5",NaT
212,"Alabama ..................... 2,626,000","1,490,609 56.8 1,394,591 53.1 96,018 6.4",NaT

Awesome. The indexing for the rows was kept intact so we can pull some tricks later. 

Now we want to actually generate the dates in the format we want in a monthly frequency. We can do that by creating another new dataframe (it can probably be done more efficiently but this is how I did it) and set a DatetimeIndex using `.date_range()`. The date range is from 1/1/1976 to 4/1/2020, with `freq='M'` to make sure the interpolation is done monthly.

In [17]:
date = pd.date_range(start='1/1/1976', end='4/1/2020', freq='M')

In [18]:
date

DatetimeIndex(['1976-01-31', '1976-02-29', '1976-03-31', '1976-04-30',
               '1976-05-31', '1976-06-30', '1976-07-31', '1976-08-31',
               '1976-09-30', '1976-10-31',
               ...
               '2019-06-30', '2019-07-31', '2019-08-31', '2019-09-30',
               '2019-10-31', '2019-11-30', '2019-12-31', '2020-01-31',
               '2020-02-29', '2020-03-31'],
              dtype='datetime64[ns]', length=531, freq='M')

One detail about `.date_range()` is that the dates generated use the last day of the month when using the monthly frequency. Just a detail to keep in mind which will be addressed later.

Now we want our `Date` column to be equal to the DatetimeIndex we just generated. Then we will address that little detail I mentioned above using `.to_datetime()` again. The point is that we use the `.dt.strftime('%Y-%m')` method to turn out datetime data into a string in a specific format, and then pass that into `.to_datetime()` to convert it *back* into datetime format. That converts it to beginning of month dates because when converting a string like '01-1976' into datetime, pandas automatically converts it to '01-01-1976' in datetime. Read more about string formatting for dates [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.strftime.html).

In [19]:
bridge['Date'] = date
bridge['Date'] = pd.to_datetime(bridge['Date'].dt.strftime('%Y-%m'))

D:\Programs\Anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
D:\Programs\Anaconda\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

I wouldn't worry about that warning. Let's see what happened in our `bridge` dataframe.

In [20]:
bridge.head()

,State/Area_temp,temp,Date
0,"Alabama ..................... 2,605,000","1,492,409 57.3 1,392,154 53.4 100,255 6.7",1976-01-01
53,"Alabama ..................... 2,610,000","1,491,820 57.2 1,391,975 53.3 99,845 6.7",1976-02-01
106,"Alabama ..................... 2,615,000","1,490,600 57.0 1,392,137 53.2 98,463 6.6",1976-03-01
159,"Alabama ..................... 2,620,000","1,489,947 56.9 1,393,177 53.2 96,770 6.5",1976-04-01
212,"Alabama ..................... 2,626,000","1,490,609 56.8 1,394,591 53.1 96,018 6.4",1976-05-01

Great! The format for the dates is 'YYYY-MM-DD' which is the ISO 8601 format for dates. Now we want to put the Alabamas in our `bridge` dataframe back into the original dataframe, with the new filled out `Date` column with it. We're going to replace the rows in the old `df` dataframe with the rows in our `bridge` dataframe by *their index* using `.loc`. If you try doing this without having the same amount of columns in both dataframes, you will probably get an error.

In [21]:
df.loc[bridge.index] = bridge

In [22]:
df.head()

,State/Area_temp,temp,Date
0,"Alabama ..................... 2,605,000","1,492,409 57.3 1,392,154 53.4 100,255 6.7",1976-01-01
1,"Alaska ...................... 232,000","159,154 68.6 147,809 63.7 11,345 7.1",NaT
2,"Arizona ..................... 1,621,000","972,413 60.0 872,738 53.8 99,675 10.3",NaT
3,"Arkansas .................... 1,536,000","882,835 57.5 817,756 53.2 65,079 7.4",NaT
4,"California .................. 15,621,000","9,781,720 62.6 8,892,663 56.9 889,057 9.1",NaT

In [23]:
df[50:55]

,State/Area_temp,temp,Date
50,"West Virginia ............... 1,352,000","702,600 52.0 647,491 47.9 55,109 7.8",NaT
51,"Wisconsin ................... 3,245,000","2,125,315 65.5 2,003,102 61.7 122,213 5.8",NaT
52,"Wyoming ..................... 270,000","175,876 65.1 168,592 62.4 7,284 4.1",NaT
53,"Alabama ..................... 2,610,000","1,491,820 57.2 1,391,975 53.3 99,845 6.7",1976-02-01
54,"Alaska ...................... 234,000","158,961 67.9 147,666 63.1 11,295 7.1",NaT

So far things are shaping up. Now we're gonna go ahead and use `.str.split()` to create new columns using whitespace in the `temp` column as a separator. The new columns will be placed in a new dataframe, which I went ahead and called `new_cols` just because. This could also be done in the same dataframe, but I don't want to make any mistakes.

In [24]:
new_cols = df['temp'].str.split(' ', expand=True)

In [25]:
new_cols.head()

           0     1          2     3        4     5
0  1,492,409  57.3  1,392,154  53.4  100,255   6.7
1    159,154  68.6    147,809  63.7   11,345   7.1
2    972,413  60.0    872,738  53.8   99,675  10.3
3    882,835  57.5    817,756  53.2   65,079   7.4
4  9,781,720  62.6  8,892,663  56.9  889,057   9.1

Because we know what the end result looks like, we know which data is which. In the `temp` column we have: Labor Force, Labor Force %, Employed, Emloyment of Tot Pop %, Unemployed, Unemployment Rate. We can assign the newly created columns to our old `df` dataframe now and put the appropriate name for the data.

In [26]:
df['Labor Force'] = new_cols[0]
df['Labor Force %'] = new_cols[1]
df['Employed'] = new_cols[2]
df['Employment of Tot Pop %'] = new_cols[3]
df['Unemployed'] = new_cols[4]
df['Unemployment Rate'] = new_cols[5]

del df['temp']

In [27]:
df.head()

,State/Area_temp,Date,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate
0,"Alabama ..................... 2,605,000",1976-01-01,"1,492,409",57.3,"1,392,154",53.4,"100,255",6.7
1,"Alaska ...................... 232,000",NaT,"159,154",68.6,"147,809",63.7,"11,345",7.1
2,"Arizona ..................... 1,621,000",NaT,"972,413",60.0,"872,738",53.8,"99,675",10.3
3,"Arkansas .................... 1,536,000",NaT,"882,835",57.5,"817,756",53.2,"65,079",7.4
4,"California .................. 15,621,000",NaT,"9,781,720",62.6,"8,892,663",56.9,"889,057",9.1

Now this is starting to look more and more like the end result. We're getting there. Now we need to use the same `.replace()` trick again with the periods *and* whitespaces in `State/Area_temp` to make `str.split()` possible.

In [28]:
df['State/Area_temp'].replace(r'\s+', ' ', regex=True, inplace=True)
df['State/Area_temp'].replace(r'\.+', '.', regex=True, inplace=True)

In [29]:
df.head()

,State/Area_temp,Date,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate
0,"Alabama . 2,605,000",1976-01-01,"1,492,409",57.3,"1,392,154",53.4,"100,255",6.7
1,"Alaska . 232,000",NaT,"159,154",68.6,"147,809",63.7,"11,345",7.1
2,"Arizona . 1,621,000",NaT,"972,413",60.0,"872,738",53.8,"99,675",10.3
3,"Arkansas . 1,536,000",NaT,"882,835",57.5,"817,756",53.2,"65,079",7.4
4,"California . 15,621,000",NaT,"9,781,720",62.6,"8,892,663",56.9,"889,057",9.1

We can repeat the same protocol when using `.str.split()` and place the new columns in a new dataframe and then assign them back into the original one by creating new columns in `df` and making them equal to the columns in this new dataframe called `sa_new_cols`.

In [30]:
sa_new_cols = df['State/Area_temp'].str.split('.', expand=True)

In [31]:
sa_new_cols.head()

             0            1
0     Alabama     2,605,000
1      Alaska       232,000
2     Arizona     1,621,000
3    Arkansas     1,536,000
4  California    15,621,000

In [32]:
df['State/Area'] = sa_new_cols[0]
df['Population'] = sa_new_cols[1]

In [33]:
del df['State/Area_temp']

In [34]:
df.head()

,Date,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate,State/Area,Population
0,1976-01-01,"1,492,409",57.3,"1,392,154",53.4,"100,255",6.7,Alabama,"2,605,000"
1,NaT,"159,154",68.6,"147,809",63.7,"11,345",7.1,Alaska,"232,000"
2,NaT,"972,413",60.0,"872,738",53.8,"99,675",10.3,Arizona,"1,621,000"
3,NaT,"882,835",57.5,"817,756",53.2,"65,079",7.4,Arkansas,"1,536,000"
4,NaT,"9,781,720",62.6,"8,892,663",56.9,"889,057",9.1,California,"15,621,000"

Let's go ahead and use `.fillna()` with the `method='ffill'` argument to fill in empty cells using data from above ('forward filling').

In [35]:
df['Date'].fillna(method='ffill', inplace=True)

In [36]:
df.head()

,Date,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate,State/Area,Population
0,1976-01-01,"1,492,409",57.3,"1,392,154",53.4,"100,255",6.7,Alabama,"2,605,000"
1,1976-01-01,"159,154",68.6,"147,809",63.7,"11,345",7.1,Alaska,"232,000"
2,1976-01-01,"972,413",60.0,"872,738",53.8,"99,675",10.3,Arizona,"1,621,000"
3,1976-01-01,"882,835",57.5,"817,756",53.2,"65,079",7.4,Arkansas,"1,536,000"
4,1976-01-01,"9,781,720",62.6,"8,892,663",56.9,"889,057",9.1,California,"15,621,000"

Neat! Now we just have to reorganize the data and then we're finished right? Not really. We need to prepare this data for analysis and visualization and it's not quite there yet. That's because the data is still in string format and that is unusable for analysis.

In [37]:
df.dtypes

Date                       datetime64[ns]
Labor Force                        object
Labor Force %                      object
Employed                           object
Employment of Tot Pop %            object
Unemployed                         object
Unemployment Rate                  object
State/Area                         object
Population                         object
dtype: object

Every column except `State/Area` needs to be converted to either `int` or `float` data types. That way any statistical program or plotting package will recognize the data as numbers and not give you an error. Before that we should use `.str.replace()` to remove any commas, because attempting to use `.astype()` to convert numbers with comma separators in a string will throw an error.

In [38]:
df['Labor Force'] = df['Labor Force'].str.replace(',', '')
df['Employed'] = df['Employed'].str.replace(',', '')
df['Unemployed'] = df['Unemployed'].str.replace(',', '')
df['Population'] = df['Population'].str.replace(',', '')

In [39]:
df.head()

,Date,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate,State/Area,Population
0,1976-01-01,1492409,57.3,1392154,53.4,100255,6.7,Alabama,2605000
1,1976-01-01,159154,68.6,147809,63.7,11345,7.1,Alaska,232000
2,1976-01-01,972413,60.0,872738,53.8,99675,10.3,Arizona,1621000
3,1976-01-01,882835,57.5,817756,53.2,65079,7.4,Arkansas,1536000
4,1976-01-01,9781720,62.6,8892663,56.9,889057,9.1,California,15621000

Now we just have to reassign the data types now and then reorganize the columns. Then this will be ready to use! Note that `.astype()` is finnicky and you must use it in this method if you want to convert your data inplace.

In [40]:
df['Labor Force'] = df['Labor Force'].astype('int')
df['Labor Force %'] = df['Labor Force %'].astype('float')
df['Employed'] = df['Employed'].astype('int')
df['Employment of Tot Pop %'] = df['Employment of Tot Pop %'].astype('float')
df['Unemployed'] = df['Unemployed'].astype('int')
df['Unemployment Rate'] = df['Unemployment Rate'].astype('float')
df['Population'] = df['Population'].astype('int')

In [41]:
df.dtypes

Date                       datetime64[ns]
Labor Force                         int32
Labor Force %                     float64
Employed                            int32
Employment of Tot Pop %           float64
Unemployed                          int32
Unemployment Rate                 float64
State/Area                         object
Population                          int32
dtype: object

Next we reorganize the columns by creating a list with the columns in the order we want and then reassign the ordering.

In [42]:
cols = ['State/Area', 'Population', 'Labor Force', 'Labor Force %', 'Employed', 'Employment of Tot Pop %', 'Unemployed', 'Unemployment Rate', 'Date']
df = df[cols]

One last passthrough on `State/Area` just to make sure there are absolutely zero whitespaces. `str.strip()` will finish this off.

In [43]:
df['State/Area'] = df['State/Area'].str.strip()

One last look before committing.

In [44]:
df.head()

,State/Area,Population,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate,Date
0,Alabama,2605000,1492409,57.3,1392154,53.4,100255,6.7,1976-01-01
1,Alaska,232000,159154,68.6,147809,63.7,11345,7.1,1976-01-01
2,Arizona,1621000,972413,60.0,872738,53.8,99675,10.3,1976-01-01
3,Arkansas,1536000,882835,57.5,817756,53.2,65079,7.4,1976-01-01
4,California,15621000,9781720,62.6,8892663,56.9,889057,9.1,1976-01-01

In [45]:
df.tail()

,State/Area,Population,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate,Date
28138,Virginia,6698449,4429864,66.1,4282906,63.9,146958,3.3,2020-03-01
28139,Washington,6078899,3889700,64.0,3692131,60.7,197569,5.1,2020-03-01
28140,West Virginia,1441638,818064,56.7,768569,53.3,49495,6.1,2020-03-01
28141,Wisconsin,4649248,3104804,66.8,2999099,64.5,105705,3.4,2020-03-01
28142,Wyoming,451333,294911,65.3,283862,62.9,11049,3.7,2020-03-01

That was challenging, but we did it! Let's save this and move onto the next part.

In [46]:
df.to_csv('processed.csv', index=False)

### Plotting

We're going to try to plot this data using Plotly! I can't really walk you guys through it as much but I will still post the code here!

We will start by importing the modules we need.

In [47]:
import plotly.graph_objs as go
import plotly.offline as pyo

We'll be using the same dataset we just cleaned up! Since we know there are no problems with the data we can just go ahead and move on with plotting.

Let's say we want to plot the unemployment rate in the Southeast U.S. That includes Florida, Georgia, Tennesee, Alabama, Mississippi, and Louisiana. Sorry South Carolina, you don't count. Not this time.

We are going to create new dataframes containing only data from each respective state. Like so:

In [48]:
# # # States # # #
florida = df[df['State/Area'] == 'Florida']
georgia = df[df['State/Area'] == 'Georgia']
tennessee = df[df['State/Area'] == 'Tennessee']
alabama = df[df['State/Area'] == 'Alabama']
mississippi = df[df['State/Area'] == 'Mississippi']
louisiana = df[df['State/Area'] == 'Louisiana']
# # # States # # #

Let's peek at `florida` and see what they're up to.

In [49]:
florida.head()

,State/Area,Population,Labor Force,Labor Force %,Employed,Employment of Tot Pop %,Unemployed,Unemployment Rate,Date
10,Florida,6421000,3592149,55.9,3248523,50.6,343626,9.6,1976-01-01
63,Florida,6437000,3591389,55.8,3247280,50.4,344109,9.6,1976-02-01
116,Florida,6452000,3591633,55.7,3249159,50.4,342474,9.5,1976-03-01
169,Florida,6468000,3594014,55.6,3258015,50.4,335999,9.3,1976-04-01
222,Florida,6483000,3597871,55.5,3269479,50.4,328392,9.1,1976-05-01

Not much, it would seem. If you know a thing or two about plotly.go then you know you have to make each individual trace for each state using `go.Scatter()`. Make sure `mode='lines'` or else you'll be left with a scatter plot. Fill in the `x`, `y`, and `name` parameters as well.

In [50]:
fl_trace = go.Scatter(x=florida['Date'], y=florida['Unemployment Rate'], mode='lines', name='FL Unemployment Rate (%)')
ga_trace = go.Scatter(x=georgia['Date'], y=georgia['Unemployment Rate'], mode='lines', name='GA Unemployment Rate (%)')
tn_trace = go.Scatter(x=tennessee['Date'], y=tennessee['Unemployment Rate'], mode='lines', name='TN Unemployment Rate (%)')
al_trace = go.Scatter(x=alabama['Date'], y=alabama['Unemployment Rate'], mode='lines', name='AL Unemployment Rate (%)')
ms_trace = go.Scatter(x=mississippi['Date'], y=mississippi['Unemployment Rate'], mode='lines', name='MS Unemployment Rate (%)')
la_trace = go.Scatter(x=louisiana['Date'], y=louisiana['Unemployment Rate'], mode='lines', name='LA Unemployment Rate (%)')

Now we make a new variable called `data` which is a list of the above traces.

In [51]:
data = [fl_trace, ga_trace, tn_trace, al_trace, ms_trace, la_trace]

Now the `layout` variable will be made using `go.Layout()`. I fill out the `title` parameter and fill out the `xaxis` and `yaxis` parameter using `dict(title='')` because that's just how the documentation goes for plotly.go. Using `xaxis={'title': 'Date'}` is also permissible, for example.

In [52]:
layout = go.Layout(title='Southeastern US Unemployment Rate (%), Monthly (1976-2020)', xaxis=dict(title='Date'), yaxis=dict(title='Unemployment Rate (%)'))

Since plotly is actually kind of intuitive, we can just fill in the `data` and `layout` parameters with the conveniently named variables we created. Create a new variable called `fig` and use `go.Figure()` like so.

In [53]:
fig = go.Figure(data=data, layout=layout)

Now just use `pyo.plot()` and make sure to pass the above `fig` variable. Use `filename` to give your newly created html file a name. In this case I use SEUS_unemployment.html.

In [54]:
pyo.plot(fig, filename='SEUS_unemployment.html')

'SEUS_unemployment.html'

## Author's note

That's all of it. Hopefully this gives you guys a good perspective on what data cleaning is all about.

Anyone doing econometrics/analysis should know that it's not all glamorous. Someone has to do the dirty work to prepare these datasets/spreadsheets. Data cleaning is an important part of the process. Get affiliated with pandas and numpy to make sure you can do that well. 

Thanks for reading.

*-Luis Hernandez*